Reports/ВаловаяПрибыльПланФактВнешний.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Report>
		<Properties>
			<Name>ВаловаяПрибыльПланФактВнешний</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>УниверсальныйОтчет</Name>
					<Type>
						<v8:Type>cfg:ReportObject.УниверсальныйОтчет</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

AccumulationRegisters/ПродажиПлан_сд.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<AccumulationRegister>
		<Properties>
			<Name>ПродажиПлан_сд</Name>
			<Comment>(Упр)</Comment>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтоимостьПодразделенияОплатаЗатрат</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаПокупки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦенаПокупки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаказПокупателя</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуПокупателю</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/Продажи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<AccumulationRegister>
		<Properties>
			<Name>Продажи</Name>
			<Comment>(Упр)</Comment>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтоимостьБезСкидок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтоимостьПодразделенияОплатаЗатрат</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаказПокупателя</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуПокупателю</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументПродажи</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровОтПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомитентуОПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетОРозничныхПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомиссионераОПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриемТовараНаХранение</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ПродажиСебестоимость.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<AccumulationRegister>
		<Properties>
			<Name>ПродажиСебестоимость</Name>
			<Comment>(Упр)</Comment>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>СписаниеПартий</Name>
					<Comment>Регламентный документ, сформировавший движения</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументДвижения</Name>
					<Comment>Документ, к которому относится данное движение</Comment>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументДвиженияПериод</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаказПокупателя</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуПокупателю</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументОприходования</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровОтПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслугВНТТ</v8:Type>
						<v8:Type>cfg:DocumentRef.КомплектацияНоменклатуры</v8:Type>
						<v8:Type>cfg:DocumentRef.ОприходованиеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.АвансовыйОтчет</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Reports/ВаловаяПрибыльПланФактВнешний/Ext/ObjectModule.bsl
//FOFA Внимательно
#Если Клиент Тогда
	
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ НАЧАЛЬНОЙ НАСТРОЙКИ ОТЧЕТА

// Процедура установки начальных настроек отчета с использованием текста запроса
//
Процедура УстановитьНачальныеНастройки(ДополнительныеПараметры = Неопределено) Экспорт
	
	// Настройка общих параметров универсального отчета
	
	// Содержит название отчета, которое будет выводиться в шапке.
	// Тип: Строка.
	// Пример:
	// УниверсальныйОтчет.мНазваниеОтчета = "Название отчета";
	УниверсальныйОтчет.мНазваниеОтчета = СокрЛП(ЭтотОбъект.Метаданные().Синоним);
	
	// Содержит признак необходимости отображения надписи и поля выбора раздела учета в форме настройки.
	// Тип: Булево.
	// Значение по умолчанию: Истина.
	// Пример:
	// УниверсальныйОтчет.мВыбиратьИмяРегистра = Ложь;
	УниверсальныйОтчет.мВыбиратьИмяРегистра = Ложь;
	
	// Содержит имя регистра, по метаданным которого будет выполняться заполнение настроек отчета.
	// Тип: Строка.
	// Пример:
	// УниверсальныйОтчет.ИмяРегистра = "ТоварыНаСкладах";
	
	// Содержит признак необходимости вывода отрицательных значений показателей красным цветом.
	// Тип: Булево.
	// Значение по умолчанию: Ложь.
	// Пример:
	// УниверсальныйОтчет.ОтрицательноеКрасным = Истина;
	
	// Содержит признак необходимости вывода в отчет общих итогов.
	// Тип: Булево.
	// Значение по умолчанию: Истина.
	// Пример:
	// УниверсальныйОтчет.ВыводитьОбщиеИтоги = Ложь;
	
	// Содержит признак необходимости вывода детальных записей в отчет.
	// Тип: Булево.
	// Значение по умолчанию: Ложь.
	// Пример:
	// УниверсальныйОтчет.ВыводитьДетальныеЗаписи = Истина;
	
	// Содержит признак необходимости отображения флага использования свойств и категорий в форме настройки.
	// Тип: Булево.
	// Значение по умолчанию: Истина.
	// Пример:
	// УниверсальныйОтчет.мВыбиратьИспользованиеСвойств = Ложь;
	//УниверсальныйОтчет.мВыбиратьИспользованиеСвойств = Истина;
	
	// Содержит признак использования свойств и категорий при заполнении настроек отчета.
	// Тип: Булево.
	// Значение по умолчанию: Ложь.
	// Пример:
	// УниверсальныйОтчет.ИспользоватьСвойстваИКатегории = Истина;
	
	// Содержит признак использования простой формы настроек отчета без группировок колонок.
	// Тип: Булево.
	// Значение по умолчанию: Ложь.
	// Пример:
	// УниверсальныйОтчет.мРежимФормыНастройкиБезГруппировокКолонок = Истина;
	
	// Дополнительные параметры, переданные из отчета, вызвавшего расшифровку.
	// Информация, передаваемая в переменной ДополнительныеПараметры, может быть использована
	// для реализации специфичных для данного отчета параметрических настроек.
	
	// Описание исходного текста запроса.
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.Проект КАК Проект,
	|	ВложенныйЗапрос.Подразделение КАК Подразделение,
	|	ВложенныйЗапрос.Покупатель КАК Покупатель,
	|	ВложенныйЗапрос.ДоговорПокупателя КАК ДоговорПокупателя,
	|	ВложенныйЗапрос.Номенклатура КАК Номенклатура,
	|	ВложенныйЗапрос.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ВложенныйЗапрос.ЗаказПокупателя КАК ЗаказПокупателя,
	|	ВложенныйЗапрос.Регистратор КАК Регистратор,
	|	ПРЕДСТАВЛЕНИЕ(ВложенныйЗапрос.Организация) КАК ОрганизацияПредставление,
	|	ПРЕДСТАВЛЕНИЕ(ВложенныйЗапрос.Проект) КАК ПроектПредставление,
	|	ПРЕДСТАВЛЕНИЕ(ВложенныйЗапрос.Подразделение) КАК ПодразделениеПредставление,
	|	ПРЕДСТАВЛЕНИЕ(ВложенныйЗапрос.Покупатель) КАК ПокупательПредставление,
	|	ПРЕДСТАВЛЕНИЕ(ВложенныйЗапрос.ДоговорПокупателя) КАК ДоговорПокупателяПредставление,
	|	ПРЕДСТАВЛЕНИЕ(ВложенныйЗапрос.Номенклатура) КАК НоменклатураПредставление,
	|	ПРЕДСТАВЛЕНИЕ(ВложенныйЗапрос.ХарактеристикаНоменклатуры) КАК ХарактеристикаНоменклатурыПредставление,
	|	ПРЕДСТАВЛЕНИЕ(ВложенныйЗапрос.ЗаказПокупателя) КАК ЗаказПокупателяПредставление,
	|	ПРЕДСТАВЛЕНИЕ(ВложенныйЗапрос.Регистратор) КАК РегистраторПредставление,
	|	ВложенныйЗапрос.Период КАК Период,
	|	ВложенныйЗапрос.ПериодДень КАК ПериодДень,
	|	ВложенныйЗапрос.ПериодНеделя КАК ПериодНеделя,
	|	ВложенныйЗапрос.ПериодДекада КАК ПериодДекада,
	|	ВложенныйЗапрос.ПериодМесяц КАК ПериодМесяц,
	|	ВложенныйЗапрос.ПериодКвартал КАК ПериодКвартал,
	|	ВложенныйЗапрос.ПериодПолугодие КАК ПериодПолугодие,
	|	ВложенныйЗапрос.ПериодГод КАК ПериодГод,
	|	ВложенныйЗапрос.Количество КАК Количество,
	|	ВложенныйЗапрос.КоличествоЕдиницОтчетов КАК КоличествоЕдиницОтчетов,
	|	ВложенныйЗапрос.КоличествоБазовыхЕдиниц КАК КоличествоБазовыхЕдиниц,
	|	ВложенныйЗапрос.СтоимостьБезНДС КАК СтоимостьБезНДС,
	|	ВложенныйЗапрос.НДС КАК НДС,
	|	ВложенныйЗапрос.Стоимость КАК Стоимость,
	|	ВложенныйЗапрос.СтоимостьПодразделенияОплатаЗатрат КАК СтоимостьПодразделенияОплатаЗатрат,
	|	ВложенныйЗапрос.Себестоимость КАК Себестоимость,
	|	ВложенныйЗапрос.ВаловаяПрибыль КАК ВаловаяПрибыль,
	|	ВложенныйЗапрос.Эффективность КАК Эффективность,
	|	ВложенныйЗапрос.Рентабельность КАК Рентабельность,
	|	ВложенныйЗапрос.СуммаПлан КАК СуммаПлан,
	|	ВложенныйЗапрос.СуммаПокупкиПлан КАК СуммаПокупкиПлан,
	|	ВложенныйЗапрос.КоличествоПлан КАК КоличествоПлан,
	|	ВложенныйЗапрос.ВаловаяПрибыльПлан КАК ВаловаяПрибыльПлан,
	|	ВложенныйЗапрос.РазницаПланФакт КАК РазницаПланФакт,
	|	ВложенныйЗапрос.РентабельностьПлан КАК РентабельностьПлан
	|{ВЫБРАТЬ
	|	Организация.*,
	|	Проект.*,
	|	Подразделение.*,
	|	Покупатель.*,
	|	ДоговорПокупателя.*,
	|	Номенклатура.*,
	|	ХарактеристикаНоменклатуры.*,
	|	ЗаказПокупателя.*,
	|	Регистратор.*,
	|	Период,
	|	ПериодДень,
	|	ПериодНеделя,
	|	ПериодДекада,
	|	ПериодМесяц,
	|	ПериодКвартал,
	|	ПериодПолугодие,
	|	ПериодГод,
	|	Количество,
	|	КоличествоЕдиницОтчетов,
	|	КоличествоБазовыхЕдиниц,
	|	СтоимостьБезНДС,
	|	НДС,
	|	Стоимость,
	|	СтоимостьПодразделенияОплатаЗатрат,
	|	Себестоимость,
	|	ВаловаяПрибыль,
	|	Эффективность,
	|	Рентабельность,
	|	ВаловаяПрибыльПлан,
	|	КоличествоПлан,
	|	СуммаПокупкиПлан,
	|	СуммаПлан,
	|	РазницаПланФакт,
	|	РентабельностьПлан}
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВложенныйЗапрос.Организация КАК Организация,
	|		ВложенныйЗапрос.Проект КАК Проект,
	|		ВложенныйЗапрос.Подразделение КАК Подразделение,
	|		ВложенныйЗапрос.Покупатель КАК Покупатель,
	|		ВложенныйЗапрос.ДоговорПокупателя КАК ДоговорПокупателя,
	|		ВложенныйЗапрос.Номенклатура КАК Номенклатура,
	|		ВложенныйЗапрос.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|		ВложенныйЗапрос.ЗаказПокупателя КАК ЗаказПокупателя,
	|		ВложенныйЗапрос.Регистратор КАК Регистратор,
	|		ВложенныйЗапрос.Период КАК Период,
	|		НАЧАЛОПЕРИОДА(ВложенныйЗапрос.Период, ДЕНЬ) КАК ПериодДень,
	|		НАЧАЛОПЕРИОДА(ВложенныйЗапрос.Период, НЕДЕЛЯ) КАК ПериодНеделя,
	|		НАЧАЛОПЕРИОДА(ВложенныйЗапрос.Период, ДЕКАДА) КАК ПериодДекада,
	|		НАЧАЛОПЕРИОДА(ВложенныйЗапрос.Период, МЕСЯЦ) КАК ПериодМесяц,
	|		НАЧАЛОПЕРИОДА(ВложенныйЗапрос.Период, КВАРТАЛ) КАК ПериодКвартал,
	|		НАЧАЛОПЕРИОДА(ВложенныйЗапрос.Период, ПОЛУГОДИЕ) КАК ПериодПолугодие,
	|		НАЧАЛОПЕРИОДА(ВложенныйЗапрос.Период, ГОД) КАК ПериодГод,
	|		СУММА(ВложенныйЗапрос.Количество) КАК Количество,
	|		СУММА(ВложенныйЗапрос.КоличествоЕдиницОтчетов) КАК КоличествоЕдиницОтчетов,
	|		СУММА(ВложенныйЗапрос.КоличествоБазовыхЕдиниц) КАК КоличествоБазовыхЕдиниц,
	|		СУММА(ВложенныйЗапрос.СтоимостьБезНДС) КАК СтоимостьБезНДС,
	|		СУММА(ВложенныйЗапрос.НДС) КАК НДС,
	|		СУММА(ВложенныйЗапрос.Стоимость) КАК Стоимость,
	|		СУММА(ВложенныйЗапрос.СтоимостьПодразделенияОплатаЗатрат) КАК СтоимостьПодразделенияОплатаЗатрат,
	|		СУММА(ВложенныйЗапрос.Себестоимость) КАК Себестоимость,
	|		ВЫБОР
	|			КОГДА &НеВключатьНДСВСтоимостьПартий
	|				ТОГДА СУММА(ВложенныйЗапрос.СтоимостьБезНДС)
	|			ИНАЧЕ СУММА(ВложенныйЗапрос.Стоимость)
	|		КОНЕЦ - СУММА(ВложенныйЗапрос.Себестоимость) КАК ВаловаяПрибыль,
	|		100 * ВЫБОР
	|			КОГДА &НеВключатьНДСВСтоимостьПартий
	|				ТОГДА ВЫБОР
	|						КОГДА СУММА(ВложенныйЗапрос.Себестоимость) <> 0
	|							ТОГДА (СУММА(ВложенныйЗапрос.СтоимостьБезНДС) - СУММА(ВложенныйЗапрос.Себестоимость)) / СУММА(ВложенныйЗапрос.Себестоимость)
	|						ИНАЧЕ 0
	|					КОНЕЦ
	|			ИНАЧЕ ВЫБОР
	|					КОГДА СУММА(ВложенныйЗапрос.Себестоимость) <> 0
	|						ТОГДА (СУММА(ВложенныйЗапрос.Стоимость) - СУММА(ВложенныйЗапрос.Себестоимость)) / СУММА(ВложенныйЗапрос.Себестоимость)
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		КОНЕЦ КАК Эффективность,
	|		100 * ВЫБОР
	|			КОГДА &НеВключатьНДСВСтоимостьПартий
	|				ТОГДА ВЫБОР
	|						КОГДА СУММА(ВложенныйЗапрос.СтоимостьБезНДС) <> 0
	|							ТОГДА (СУММА(ВложенныйЗапрос.СтоимостьБезНДС) - СУММА(ВложенныйЗапрос.Себестоимость)) / СУММА(ВложенныйЗапрос.СтоимостьБезНДС)
	|						ИНАЧЕ 0
	|					КОНЕЦ
	|			ИНАЧЕ ВЫБОР
	|					КОГДА СУММА(ВложенныйЗапрос.Стоимость) <> 0
	|						ТОГДА (СУММА(ВложенныйЗапрос.Стоимость) - СУММА(ВложенныйЗапрос.Себестоимость)) / СУММА(ВложенныйЗапрос.Стоимость)
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		КОНЕЦ КАК Рентабельность,
	|		СУММА(ВложенныйЗапрос.СуммаПлан) КАК СуммаПлан,
	|		СУММА(ВложенныйЗапрос.СуммаПокупкиПлан) КАК СуммаПокупкиПлан,
	|		СУММА(ВложенныйЗапрос.НДСПлан) КАК НДСПлан,
	|		СУММА(ВложенныйЗапрос.КоличествоПлан) КАК КоличествоПлан,
	|		СУММА(ВложенныйЗапрос.СуммаПлан) - СУММА(ВложенныйЗапрос.СуммаПокупкиПлан) КАК ВаловаяПрибыльПлан,
	|		СУММА(ВложенныйЗапрос.СуммаПлан) - СУММА(ВложенныйЗапрос.СуммаПокупкиПлан) - (ВЫБОР
	|			КОГДА &НеВключатьНДСВСтоимостьПартий
	|				ТОГДА СУММА(ВложенныйЗапрос.СтоимостьБезНДС)
	|			ИНАЧЕ СУММА(ВложенныйЗапрос.Стоимость)
	|		КОНЕЦ - СУММА(ВложенныйЗапрос.Себестоимость)) КАК РазницаПланФакт,
	|		100 * ВЫБОР
	|			КОГДА СУММА(ВложенныйЗапрос.СуммаПлан) <> 0
	|				ТОГДА (СУММА(ВложенныйЗапрос.СуммаПлан) - СУММА(ВложенныйЗапрос.СуммаПокупкиПлан)) / СУММА(ВложенныйЗапрос.СуммаПлан)
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК РентабельностьПлан
	|	{ВЫБРАТЬ
	|		Организация,
	|		Проект,
	|		Подразделение,
	|		Покупатель,
	|		ДоговорПокупателя,
	|		Номенклатура,
	|		ХарактеристикаНоменклатуры,
	|		ЗаказПокупателя,
	|		Регистратор,
	|		Период,
	|		ПериодДень,
	|		ПериодНеделя,
	|		ПериодДекада,
	|		ПериодМесяц,
	|		ПериодКвартал,
	|		ПериодПолугодие,
	|		ПериодГод}
	|	ИЗ
	|		(ВЫБРАТЬ
	|			ЕСТЬNULL(ПродажиОбороты.Проект, ЗНАЧЕНИЕ(Справочник.проекты.ПустаяСсылка)) КАК Проект,
	|			ПродажиПлан_сдОбороты.Подразделение КАК Подразделение,
	|			ПродажиПлан_сдОбороты.Контрагент КАК Покупатель,
	|			ПродажиПлан_сдОбороты.ДоговорКонтрагента КАК ДоговорПокупателя,
	|			ПродажиПлан_сдОбороты.Номенклатура КАК Номенклатура,
	|			ПродажиПлан_сдОбороты.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|			ПродажиПлан_сдОбороты.ЗаказПокупателя КАК ЗаказПокупателя,
	|			ПродажиПлан_сдОбороты.Организация КАК Организация,
	|			ПродажиПлан_сдОбороты.Регистратор КАК Регистратор,
	|			ПродажиПлан_сдОбороты.Период КАК Период,
	|			ЕСТЬNULL(ПродажиОбороты.КоличествоОборот, 0) КАК Количество,
	|			ЕСТЬNULL(ПродажиОбороты.КоличествоОборот, 0) * ЕСТЬNULL(ПродажиОбороты.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент, 1) / ЕСТЬNULL(ПродажиОбороты.Номенклатура.ЕдиницаДляОтчетов.Коэффициент, 1) КАК КоличествоЕдиницОтчетов,
	|			ЕСТЬNULL(ПродажиОбороты.КоличествоОборот, 0) * ЕСТЬNULL(ПродажиОбороты.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент, 1) КАК КоличествоБазовыхЕдиниц,
	|			ЕСТЬNULL(ПродажиОбороты.СтоимостьОборот, 0) - ЕСТЬNULL(ПродажиОбороты.НДСОборот, 0) КАК СтоимостьБезНДС,
	|			ЕСТЬNULL(ПродажиОбороты.НДСОборот, 0) КАК НДС,
	|			ЕСТЬNULL(ПродажиОбороты.СтоимостьОборот, 0) КАК Стоимость,
	|			ЕСТЬNULL(ПродажиОбороты.СтоимостьПодразделенияОплатаЗатратОборот, 0) КАК СтоимостьПодразделенияОплатаЗатрат,
	|			ЕСТЬNULL(ТаблицаРегистраПродажиСебестоимость.СтоимостьОборот, 0) КАК Себестоимость,
	//+БП: d.matyash (05.03.2025) <>
	//|			ВЫБОР
	//|				КОГДА ПродажиПлан_сдОбороты.Регистратор.СуммаВключаетНДС
	//|					ТОГДА ПродажиПлан_сдОбороты.СуммаОборот
	//|				ИНАЧЕ ПродажиПлан_сдОбороты.СуммаОборот + ПродажиПлан_сдОбороты.НДСОборот
	//|			КОНЕЦ КАК СуммаПлан,
	//|			ПродажиПлан_сдОбороты.СуммаПокупкиОборот КАК СуммаПокупкиПлан,
	//|			ПродажиПлан_сдОбороты.НДСОборот КАК НДСПлан,
	//|			ПродажиПлан_сдОбороты.КоличествоОборот КАК КоличествоПлан
	//------------------------------ 
	|				ВЫБОР
	|				КОГДА ТИПЗНАЧЕНИЯ(ПродажиОбороты.Регистратор) = ТИП(Документ.ВозвратТоваровОтПокупателя)
	|					ТОГДА 0
	|				ИНАЧЕ ВЫБОР
	|						КОГДА ПродажиПлан_сдОбороты.Регистратор.СуммаВключаетНДС
	|							ТОГДА ПродажиПлан_сдОбороты.СуммаОборот
	|						ИНАЧЕ ПродажиПлан_сдОбороты.СуммаОборот + ПродажиПлан_сдОбороты.НДСОборот
	|					КОНЕЦ
	|			КОНЕЦ КАК СуммаПлан,
	|			ВЫБОР
	|				КОГДА ТИПЗНАЧЕНИЯ(ПродажиОбороты.Регистратор) = ТИП(Документ.ВозвратТоваровОтПокупателя)
	|					ТОГДА 0
	|				ИНАЧЕ ПродажиПлан_сдОбороты.СуммаПокупкиОборот
	|			КОНЕЦ КАК СуммаПокупкиПлан,
	|			ВЫБОР
	|				КОГДА ТИПЗНАЧЕНИЯ(ПродажиОбороты.Регистратор) = ТИП(Документ.ВозвратТоваровОтПокупателя)
	|					ТОГДА 0
	|				ИНАЧЕ ПродажиПлан_сдОбороты.НДСОборот
	|			КОНЕЦ КАК НДСПлан,
	|			ВЫБОР
	|				КОГДА ТИПЗНАЧЕНИЯ(ПродажиОбороты.Регистратор) = ТИП(Документ.ВозвратТоваровОтПокупателя)
	|					ТОГДА 0
	|				ИНАЧЕ ПродажиПлан_сдОбороты.КоличествоОборот
	|			КОНЕЦ КАК КоличествоПлан 
	//-БП: d.matyash (05.03.2025) <>
	|		ИЗ
	|			РегистрНакопления.ПродажиПлан_сд.Обороты(&ДатаНач, &ДатаКон, Регистратор, {(Организация).* КАК Организация, (Подразделение).* КАК Подразделение, (Контрагент).* КАК Покупатель, (ДоговорКонтрагента).* КАК ДоговорПокупателя, (Номенклатура).* КАК Номенклатура, (ХарактеристикаНоменклатуры).* КАК ХарактеристикаНоменклатуры, (ЗаказПокупателя).* КАК ЗаказПокупателя}) КАК ПродажиПлан_сдОбороты
	|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Продажи.Обороты(, , Регистратор, {(Организация).* КАК Организация, (Проект).* КАК Проект, (Подразделение).* КАК Подразделение, (Контрагент).* КАК Покупатель, (ДоговорКонтрагента).* КАК ДоговорПокупателя, (Номенклатура).* КАК Номенклатура, (ХарактеристикаНоменклатуры).* КАК ХарактеристикаНоменклатуры, (ЗаказПокупателя).* КАК ЗаказПокупателя}) КАК ПродажиОбороты
	|					ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|						ПродажиСебестоимость.Номенклатура КАК Номенклатура,
	|						ПродажиСебестоимость.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|						ПродажиСебестоимость.ЗаказПокупателя КАК ЗаказПокупателя,
	|						ВЫБОР
	|							КОГДА ПродажиСебестоимость.ДокументДвижения <> НЕОПРЕДЕЛЕНО
	|								ТОГДА ПродажиСебестоимость.ДокументДвижения
	|							ИНАЧЕ ПродажиСебестоимость.Регистратор
	|						КОНЕЦ КАК Регистратор,
	|						СУММА(ПродажиСебестоимость.Стоимость) КАК СтоимостьОборот
	|					ИЗ
	|						РегистрНакопления.ПродажиСебестоимость КАК ПродажиСебестоимость
	|					{ГДЕ
	|						ПродажиСебестоимость.Проект.* КАК Проект,
	|						ПродажиСебестоимость.Подразделение.* КАК Подразделение,
	|						ПродажиСебестоимость.Номенклатура.* КАК Номенклатура,
	|						ПродажиСебестоимость.ХарактеристикаНоменклатуры.* КАК ХарактеристикаНоменклатуры,
	|						ПродажиСебестоимость.ЗаказПокупателя.* КАК ЗаказПокупателя}
	|					
	|					СГРУППИРОВАТЬ ПО
	|						ПродажиСебестоимость.Номенклатура,
	|						ПродажиСебестоимость.ХарактеристикаНоменклатуры,
	|						ПродажиСебестоимость.ЗаказПокупателя,
	|						ВЫБОР
	|							КОГДА ПродажиСебестоимость.ДокументДвижения <> НЕОПРЕДЕЛЕНО
	|								ТОГДА ПродажиСебестоимость.ДокументДвижения
	|							ИНАЧЕ ПродажиСебестоимость.Регистратор
	|						КОНЕЦ) КАК ТаблицаРегистраПродажиСебестоимость
	|					ПО (ТаблицаРегистраПродажиСебестоимость.Номенклатура = ПродажиОбороты.Номенклатура)
	|						И (ТаблицаРегистраПродажиСебестоимость.ХарактеристикаНоменклатуры = ПродажиОбороты.ХарактеристикаНоменклатуры)
	|						И (ТаблицаРегистраПродажиСебестоимость.ЗаказПокупателя = ПродажиОбороты.ЗаказПокупателя)
	|						И (ТаблицаРегистраПродажиСебестоимость.Регистратор = ПродажиОбороты.Регистратор)
	|				ПО ПродажиПлан_сдОбороты.ЗаказПокупателя = ПродажиОбороты.ЗаказПокупателя
	|					И ПродажиПлан_сдОбороты.Номенклатура = ПродажиОбороты.Номенклатура
	|					И ПродажиПлан_сдОбороты.ДоговорКонтрагента = ПродажиОбороты.ДоговорКонтрагента
	|					И ПродажиПлан_сдОбороты.ХарактеристикаНоменклатуры = ПродажиОбороты.ХарактеристикаНоменклатуры) КАК ВложенныйЗапрос
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ВложенныйЗапрос.Организация,
	|		ВложенныйЗапрос.Проект,
	|		ВложенныйЗапрос.Подразделение,
	|		ВложенныйЗапрос.Покупатель,
	|		ВложенныйЗапрос.ДоговорПокупателя,
	|		ВложенныйЗапрос.Номенклатура,
	|		ВложенныйЗапрос.ХарактеристикаНоменклатуры,
	|		ВложенныйЗапрос.ЗаказПокупателя,
	|		ВложенныйЗапрос.Регистратор,
	|		ВложенныйЗапрос.Период
	|	
	|	ИМЕЮЩИЕ
	|		(СУММА(ВложенныйЗапрос.Количество) <> 0
	|			ИЛИ СУММА(ВложенныйЗапрос.Стоимость) <> 0
	|			ИЛИ СУММА(ЕСТЬNULL(ВложенныйЗапрос.Себестоимость, 0)) <> 0
	|			ИЛИ СУММА(ВложенныйЗапрос.КоличествоПлан) <> 0)) КАК ВложенныйЗапрос
	|{ГДЕ
	|	ВложенныйЗапрос.Регистратор.*,
	|	ВложенныйЗапрос.Период,
	|	ВложенныйЗапрос.ПериодДень,
	|	ВложенныйЗапрос.ПериодНеделя,
	|	ВложенныйЗапрос.ПериодДекада,
	|	ВложенныйЗапрос.ПериодМесяц,
	|	ВложенныйЗапрос.ПериодКвартал,
	|	ВложенныйЗапрос.ПериодПолугодие,
	|	ВложенныйЗапрос.ПериодГод,
	|	ВложенныйЗапрос.Количество,
	|	ВложенныйЗапрос.КоличествоЕдиницОтчетов,
	|	ВложенныйЗапрос.КоличествоБазовыхЕдиниц,
	|	ВложенныйЗапрос.СтоимостьБезНДС,
	|	ВложенныйЗапрос.НДС,
	|	ВложенныйЗапрос.Стоимость,
	|	ВложенныйЗапрос.СтоимостьПодразделенияОплатаЗатрат,
	|	ВложенныйЗапрос.Себестоимость,
	|	ВложенныйЗапрос.ВаловаяПрибыль,
	|	ВложенныйЗапрос.Эффективность,
	|	ВложенныйЗапрос.Рентабельность,
	|	ВложенныйЗапрос.РентабельностьПлан}
	|{УПОРЯДОЧИТЬ ПО
	|	Организация.*,
	|	Проект.*,
	|	Подразделение.*,
	|	Покупатель.*,
	|	ДоговорПокупателя.*,
	|	Номенклатура.*,
	|	ХарактеристикаНоменклатуры.*,
	|	ЗаказПокупателя.*,
	|	Регистратор.*,
	|	Период,
	|	ПериодДень,
	|	ПериодНеделя,
	|	ПериодДекада,
	|	ПериодМесяц,
	|	ПериодКвартал,
	|	ПериодПолугодие,
	|	ПериодГод,
	|	Количество,
	|	КоличествоЕдиницОтчетов,
	|	КоличествоБазовыхЕдиниц,
	|	СтоимостьБезНДС,
	|	НДС,
	|	Стоимость,
	|	СтоимостьПодразделенияОплатаЗатрат,
	|	Себестоимость,
	|	ВаловаяПрибыль,
	|	Эффективность,
	|	Рентабельность,
	|	ВаловаяПрибыльПлан,
	|	КоличествоПлан,
	|	СуммаПокупкиПлан,
	|	СуммаПлан,
	|	РазницаПланФакт,
	|	РентабельностьПлан}
	|ИТОГИ
	|	СУММА(Количество),
	|	СУММА(КоличествоЕдиницОтчетов),
	|	СУММА(КоличествоБазовыхЕдиниц),
	|	СУММА(СтоимостьБезНДС),
	|	СУММА(НДС),
	|	СУММА(Стоимость),
	|	СУММА(СтоимостьПодразделенияОплатаЗатрат),
	|	СУММА(Себестоимость),
	|	ВЫБОР
	|		КОГДА &НеВключатьНДСВСтоимостьПартий
	|			ТОГДА СУММА(СтоимостьБезНДС)
	|		ИНАЧЕ СУММА(Стоимость)
	|	КОНЕЦ - СУММА(Себестоимость) КАК ВаловаяПрибыль,
	|	100 * ВЫБОР
	|		КОГДА &НеВключатьНДСВСтоимостьПартий
	|			ТОГДА ВЫБОР
	|					КОГДА СУММА(Себестоимость) <> 0
	|						ТОГДА (СУММА(СтоимостьБезНДС) - СУММА(Себестоимость)) / СУММА(Себестоимость)
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА СУММА(Себестоимость) <> 0
	|					ТОГДА (СУММА(Стоимость) - СУММА(Себестоимость)) / СУММА(Себестоимость)
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ КАК Эффективность,
	|	100 * ВЫБОР
	|		КОГДА &НеВключатьНДСВСтоимостьПартий
	|			ТОГДА ВЫБОР
	|					КОГДА СУММА(СтоимостьБезНДС) <> 0
	|						ТОГДА (СУММА(СтоимостьБезНДС) - СУММА(Себестоимость)) / СУММА(СтоимостьБезНДС)
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА СУММА(Стоимость) <> 0
	|					ТОГДА (СУММА(Стоимость) - СУММА(Себестоимость)) / СУММА(Стоимость)
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ КАК Рентабельность,
	|	СУММА(СуммаПлан),
	|	СУММА(СуммаПокупкиПлан),
	|	СУММА(КоличествоПлан),
	|	СУММА(СуммаПлан) - СУММА(СуммаПокупкиПлан) КАК ВаловаяПрибыльПлан,
	|	ВЫБОР
	|		КОГДА &НеВключатьНДСВСтоимостьПартий
	|			ТОГДА СУММА(СтоимостьБезНДС)
	|		ИНАЧЕ СУММА(Стоимость)
	|	КОНЕЦ - СУММА(Себестоимость) - (СУММА(СуммаПлан) - СУММА(СуммаПокупкиПлан)) КАК РазницаПланФакт,
	|	100 * ВЫБОР
	|		КОГДА СУММА(ВложенныйЗапрос.СуммаПлан) <> 0
	|			ТОГДА (СУММА(ВложенныйЗапрос.СуммаПлан) - СУММА(ВложенныйЗапрос.СуммаПокупкиПлан)) / СУММА(ВложенныйЗапрос.СуммаПлан)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК РентабельностьПлан
	|ПО
	|	ОБЩИЕ
	|{ИТОГИ ПО
	|	Номенклатура.*,
	|	Организация.*,
	|	Проект.*,
	|	Подразделение.*,
	|	Покупатель.*,
	|	ДоговорПокупателя.*,
	|	ХарактеристикаНоменклатуры.*,
	|	ЗаказПокупателя.*,
	|	Регистратор.*,
	|	Период,
	|	ПериодДень,
	|	ПериодНеделя,
	|	ПериодДекада,
	|	ПериодМесяц,
	|	ПериодКвартал,
	|	ПериодПолугодие,
	|	ПериодГод}";

	// В универсальном отчете включен флаг использования свойств и категорий.
	Если УниверсальныйОтчет.ИспользоватьСвойстваИКатегории Тогда
		
		// Добавление свойств и категорий поля запроса в таблицу полей.
		// Необходимо вызывать для каждого поля запроса, предоставляющего возможность использования свойств и категорий.
		// УниверсальныйОтчет.ДобавитьСвойстваИКатегорииДляПоля(<ПсевдонимТаблицы>.<Поле> , <ПсевдонимПоля>, <Представление>, <Назначение>);
		
		УниверсальныйОтчет.ДобавитьСвойстваИКатегорииДляПоля("ВложенныйЗапрос.Организация", "Организация", "Организация", ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_Организации);
		УниверсальныйОтчет.ДобавитьСвойстваИКатегорииДляПоля("ВложенныйЗапрос.Покупатель", "Покупатель", "Покупатель", ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_Контрагенты);
		УниверсальныйОтчет.ДобавитьСвойстваИКатегорииДляПоля("ВложенныйЗапрос.ДоговорПокупателя", "ДоговорПокупателя", "Договор покупателя", ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_ДоговорыКонтрагентов);
        УниверсальныйОтчет.ДобавитьСвойстваИКатегорииДляПоля("ВложенныйЗапрос.Номенклатура", "Номенклатура", "Номенклатура", ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_Номенклатура);
        УниверсальныйОтчет.ДобавитьСвойстваИКатегорииДляПоля("ВложенныйЗапрос.ХарактеристикаНоменклатуры", "ХарактеристикаНоменклатуры", "Характеристика номенклатуры", ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_ХарактеристикиНоменклатуры);
        УниверсальныйОтчет.ДобавитьСвойстваИКатегорииДляПоля("ВложенныйЗапрос.ЗаказПокупателя", "ЗаказПокупателя", "Заказ покупателя", ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Документы);
		УниверсальныйОтчет.ДобавитьСвойстваИКатегорииДляПоля("ВложенныйЗапрос.ЗаказПокупателя", "ЗаказПокупателя", "Заказ покупателя", ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Документ_ЗаказПокупателя);
		
		// Добавление свойств и категорий в исходный текст запроса.
		УниверсальныйОтчет.ДобавитьВТекстЗапросаСвойстваИКатегории(ТекстЗапроса);
		
	КонецЕсли;
		
	// Инициализация текста запроса построителя отчета
	УниверсальныйОтчет.ПостроительОтчета.Текст = ТекстЗапроса;
	
	// Представления полей отчета.
	// Необходимо вызывать для каждого поля запроса.
	// УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить(<ИмяПоля>, <ПредставлениеПоля>);
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("Организация", "Организация");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("Проект", "Проект");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("Подразделение", "Подразделение");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("Покупатель", "Покупатель");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("ДоговорПокупателя", "Договор покупателя");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("Номенклатура", "Номенклатура");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("ХарактеристикаНоменклатуры", "Характеристика номенклатуры");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("ЗаказПокупателя", "Заказ покупателя");
	
	
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("КоличествоПлан", "Количество План");

	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("СуммаПлан", "Сумма План");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("СуммаПокупкиПлан", "Сумма Покупки План");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("ВаловаяПрибыльПлан", "Валовая Прибыль План");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("РентабельностьПлан", "Рентабельность план, %");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("РазницаПланФакт", "Разница План факт ");



	
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("Количество", "Количество (ед. хранения)");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("КоличествоЕдиницОтчетов", "Количество (ед. отчетов)");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("КоличествоБазовыхЕдиниц", "Количество (базовых ед.)");
	
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("СтоимостьБезНДС", "Стоимость продажи без НДС");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("НДС", "НДС продажи");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("Стоимость", "Стоимость продажи с НДС");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("СтоимостьПодразделенияОплатаЗатрат", "Стоимость продажи для подразделения");
	
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("Себестоимость", "Себестоимость");
	
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("ВаловаяПрибыль", "Валовая прибыль");
	
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("Эффективность", "Эффективность, %");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("Рентабельность", "Рентабельность, %"); 
	 
	
	

	// Добавление показателей
	// Необходимо вызывать для каждого добавляемого показателя.
	ВалютаУпр = глЗначениеПеременной("ВалютаУправленческогоУчета");      
	
	
	УниверсальныйОтчет.ДобавитьПоказатель("КоличествоПлан","Количество План" , Истина, "ЧЦ=15; ЧДЦ=2");
    УниверсальныйОтчет.ДобавитьПоказатель("СуммаПлан","Сумма План", Истина, "ЧЦ=15; ЧДЦ=2");
	УниверсальныйОтчет.ДобавитьПоказатель("СуммаПокупкиПлан","Сумма Покупки План" , Истина, "ЧЦ=15; ЧДЦ=2");
	УниверсальныйОтчет.ДобавитьПоказатель("ВаловаяПрибыльПлан","Валовая Прибыль План" , Истина, "ЧЦ=15; ЧДЦ=2");
	УниверсальныйОтчет.ДобавитьПоказатель("РентабельностьПлан", "Рентабельность план, %", Истина, "ЧЦ=15; ЧДЦ=2");
	УниверсальныйОтчет.ДобавитьПоказатель("РазницаПланФакт","Разница План - факт" , Истина, "ЧЦ=15; ЧДЦ=2");  
	

	
	// УниверсальныйОтчет.ДобавитьПоказатель(<ИмяПоказателя>, <ПредставлениеПоказателя>, <ВключенПоУмолчанию>, <Формат>, <ИмяГруппы>, <ПредставлениеГруппы>);
	УниверсальныйОтчет.ДобавитьПоказатель("Количество", "Ед. хранения", Истина, "ЧЦ=15; ЧДЦ=3", "Количество", "Количество");
	УниверсальныйОтчет.ДобавитьПоказатель("КоличествоБазовыхЕдиниц", "Базовых ед.", Ложь, "ЧЦ=15; ЧДЦ=3", "Количество", "Количество");
	УниверсальныйОтчет.ДобавитьПоказатель("КоличествоЕдиницОтчетов", "Ед. отчетов", Ложь, "ЧЦ=15; ЧДЦ=3", "Количество", "Количество");
	
	УниверсальныйОтчет.ДобавитьПоказатель("СтоимостьБезНДС", "Без НДС", Истина, "ЧЦ=15; ЧДЦ=2", "СтоимостьПродажи", "Стоимость продажи (" + ВалютаУпр + ")");
	УниверсальныйОтчет.ДобавитьПоказатель("НДС", "НДС", Ложь, "ЧЦ=15; ЧДЦ=2", "СтоимостьПродажи");
	УниверсальныйОтчет.ДобавитьПоказатель("Стоимость", "С НДС", Истина, "ЧЦ=15; ЧДЦ=2", "СтоимостьПродажи");
	УниверсальныйОтчет.ДобавитьПоказатель("СтоимостьПодразделенияОплатаЗатрат", "Для подразделения", Истина, "ЧЦ=15; ЧДЦ=2", "СтоимостьПодразделенияОплатаЗатрат");
	
	УниверсальныйОтчет.ДобавитьПоказатель("Себестоимость", "Себестоимость  (" + ВалютаУпр + ")", Ложь, "ЧЦ=15; ЧДЦ=2");
	
	УниверсальныйОтчет.ДобавитьПоказатель("ВаловаяПрибыль", "Валовая прибыль (" + ВалютаУпр + ")", Истина, "ЧЦ=15; ЧДЦ=2");
	
	УниверсальныйОтчет.ДобавитьПоказатель("Эффективность", "Эффективность, %", Ложь, "ЧЦ=15; ЧДЦ=2");
	УниверсальныйОтчет.ДобавитьПоказатель("Рентабельность", "Рентабельность, %", Истина, "ЧЦ=15; ЧДЦ=2");
	
	//УниверсальныйОтчет.ДобавитьПоказатель("Стоимость", "С НДС", Истина, "ЧЦ=15; ЧДЦ=2", "СтоимостьПродажи");	
	// Добавление предопределенных группировок строк отчета.
	// Необходимо вызывать для каждой добавляемой группировки строки.
	// УниверсальныйОтчет.ДобавитьИзмерениеСтроки(<ПутьКДанным>);
	//УниверсальныйОтчет.ДобавитьИзмерениеСтроки("Покупатель");        
	УниверсальныйОтчет.ДобавитьИзмерениеСтроки("ЗаказПокупателя.Ответственный");
    УниверсальныйОтчет.ДобавитьИзмерениеСтроки("ЗаказПокупателя.ПредЗаказ.УсловияДоставки");
//	УниверсальныйОтчет.ДобавитьИзмерениеСтроки("Номенклатура");  
	
	УниверсальныйОтчет.ДобавитьИзмерениеСтроки("ЗаказПокупателя.УсловиеПриема");
	УниверсальныйОтчет.ДобавитьИзмерениеСтроки("ЗаказПокупателя");



	УниверсальныйОтчет.ДобавитьИзмерениеСтроки("Номенклатура");

	
	// Добавление предопределенных группировок колонок отчета.
	// Необходимо вызывать для каждой добавляемой группировки колонки.
	// УниверсальныйОтчет.ДобавитьИзмерениеКолонки(<ПутьКДанным>);
	
	// Добавление предопределенных отборов отчета.
	// Необходимо вызывать для каждого добавляемого отбора.
	// УниверсальныйОтчет.ДобавитьОтбор(<ПутьКДанным>);
	УниверсальныйОтчет.ДобавитьОтбор("Организация");
	УниверсальныйОтчет.ДобавитьОтбор("Подразделение");
	УниверсальныйОтчет.ДобавитьОтбор("Покупатель");
	УниверсальныйОтчет.ДобавитьОтбор("Номенклатура");
	УниверсальныйОтчет.ДобавитьОтбор("Номенклатура.ВидНоменклатуры");
	УниверсальныйОтчет.ДобавитьОтбор("ЗаказПокупателя.Ответственный");
	УниверсальныйОтчет.ДобавитьОтбор("ЗаказПокупателя.ПредЗаказ.УсловияДоставки");
	УниверсальныйОтчет.ДобавитьОтбор("ЗаказПокупателя.УсловиеПриема");
	
	// Добавление предопределенных полей порядка отчета.
	// Необходимо вызывать для каждого добавляемого поля порядка.
	// УниверсальныйОтчет.ДобавитьПорядок(<ПутьКДанным>);
	
	// Установка связи подчиненных и родительских полей
	// УниверсальныйОтчет.УстановитьСвязьПолей(<ПутьКДанным>, <ПутьКДаннымРодитель>);
	
	// Установка связи полей и измерений
	// УниверсальныйОтчет.УстановитьСвязьПоляИИзмерения(<ИмяПоля>, <ИмяИзмерения>);
	
	// Установка представлений полей
	УниверсальныйОтчет.УстановитьПредставленияПолей(УниверсальныйОтчет.мСтруктураПредставлениеПолей, УниверсальныйОтчет.ПостроительОтчета);
	
	// Установка типов значений свойств в отборах отчета
	УниверсальныйОтчет.УстановитьТипыЗначенийСвойствДляОтбора();
	
	// Заполнение начальных настроек универсального отчета
	УниверсальныйОтчет.УстановитьНачальныеНастройки(Ложь);
	
	// Добавление дополнительных полей
	// Необходимо вызывать для каждого добавляемого дополнительного поля.
	// УниверсальныйОтчет.ДобавитьДополнительноеПоле(<ПутьКДанным>, <Размещение>, <Положение>);
	
КонецПроцедуры // УстановитьНачальныеНастройки()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ФОРМИРОВАНИЯ ОТЧЕТА 
	
// Процедура формирования отчета
//
Процедура СформироватьОтчет(ТабличныйДокумент) Экспорт
	
	// Перед формирование отчета можно установить необходимые параметры универсального отчета.
	ПроверитьОтборы();
	Отказ = Ложь;
	УчетнаяПолитика = ОбщегоНазначения.ПолучитьПараметрыУчетнойПолитики(?(Не ЗначениеЗаполнено(УниверсальныйОтчет.ДатаКон), ТекущаяДата(), УниверсальныйОтчет.ДатаКон), Отказ);
	УниверсальныйОтчет.ПостроительОтчета.Параметры.Вставить("НеВключатьНДСВСтоимостьПартий", ?(Отказ, Ложь, УчетнаяПолитика.НеВключатьНДСВСтоимостьПартий));
	
	УниверсальныйОтчет.СформироватьОтчет(ТабличныйДокумент);

КонецПроцедуры // СформироватьОтчет()

Процедура ПроверитьОтборы()
	
Если РольДоступна("ГаражМенеджерБезЗвітів") Тогда
		ЕстьОтборОтветственный = Ложь;
		Для Каждого ЕлОтбора из УниверсальныйОтчет.ПостроительОтчета.Отбор Цикл
			Если ЕлОтбора.ПутьКДанным = "ЗаказПокупателя.Ответственный" Тогда
				ЕстьОтборОтветственный = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Если ЕстьОтборОтветственный Тогда
			Списочек = Новый СписокЗначений;
			Менеджер = глЗначениеПеременной("глТекущийПользователь");
			Списочек.Добавить(Менеджер.Ссылка);
			//ПостроительОтчета.Отбор.Добавить("Ответственный");
			УниверсальныйОтчет.ПостроительОтчета.Отбор.ЗаказПокупателяОтветственный.ВидСравнения = ВидСравнения.ВСписке;
			УниверсальныйОтчет.ПостроительОтчета.Отбор.ЗаказПокупателяОтветственный.Значение = Списочек;
			УниверсальныйОтчет.ПостроительОтчета.Отбор.ЗаказПокупателяОтветственный.Использование = Истина;
		Иначе 
			Списочек = Новый СписокЗначений;
			Менеджер = глЗначениеПеременной("глТекущийПользователь");
			Списочек.Добавить(Менеджер.Ссылка);
			УниверсальныйОтчет.ПостроительОтчета.Отбор.Добавить("ЗаказПокупателя.Ответственный");
			УниверсальныйОтчет.ПостроительОтчета.Отбор.ЗаказПокупателяОтветственный.ВидСравнения = ВидСравнения.ВСписке;
			УниверсальныйОтчет.ПостроительОтчета.Отбор.ЗаказПокупателяОтветственный.Значение = Списочек;
			УниверсальныйОтчет.ПостроительОтчета.Отбор.ЗаказПокупателяОтветственный.Использование = Истина;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

// Процедура обработки расшифровки
//
Процедура ОбработкаРасшифровки(Расшифровка, Объект) Экспорт
	
	// Дополнительные параметры в расшифровывающий отчет можно передать
	// посредством инициализации переменной "ДополнительныеПараметры".
	
	ДополнительныеПараметры = Неопределено;
	УниверсальныйОтчет.ОбработкаРасшифровкиУниверсальногоОтчета(Расшифровка, Объект, ДополнительныеПараметры);
	
КонецПроцедуры // ОбработкаРасшифровки()

// Формирует структуру для сохранения настроек отчета
//
Процедура СформироватьСтруктуруДляСохраненияНастроек(СтруктураСНастройками) Экспорт
	
	УниверсальныйОтчет.СформироватьСтруктуруДляСохраненияНастроек(СтруктураСНастройками);
	
КонецПроцедуры // СформироватьСтруктуруДляСохраненияНастроек()

// Заполняет настройки отчета из структуры сохраненных настроек
//
Функция ВосстановитьНастройкиИзСтруктуры(СтруктураСНастройками) Экспорт
	
	Возврат УниверсальныйОтчет.ВосстановитьНастройкиИзСтруктуры(СтруктураСНастройками, ЭтотОбъект);
	
КонецФункции // ВосстановитьНастройкиИзСтруктуры()

// Содержит значение используемого режима ввода периода.
// Тип: Число.
// Возможные значения: 0 - произвольный период, 1 - на дату, 2 - неделя, 3 - декада, 4 - месяц, 5 - квартал, 6 - полугодие, 7 - год
// Значение по умолчанию: 0
// Пример:
// УниверсальныйОтчет.мРежимВводаПериода = 1;

#КонецЕсли
